#### AssetType Enumeration

---

|  |
| --- |
| See Also |

Enumerated asset types

RenderingAsset Types.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum AssetType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AssetType ``` |

| Visual C++ |
| --- |
| ``` public enum class AssetType ``` |

# Members

| Member name | Description |
| --- | --- |
| Appearance | Appearance assets (materials). |
| Content | Content assets (RPC / entourage). |

# See Also

Autodesk.Revit.DB.Visual Namespace